class AppConstants {
  static const String privacyPolicy = '''
개인정보 처리방침

1. 개인정보의 처리 목적
북스타('BookStar')는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
- 회원 가입 및 관리
- 서비스 제공 및 운영
- 마케팅 및 광고에의 활용

2. 개인정보의 처리 및 보유 기간
① 북스타는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
- 회원 가입 및 관리 : 회원 탈퇴 시까지
- 마케팅 및 광고에의 활용 : 회원 탈퇴 시까지

3. 정보주체의 권리·의무 및 그 행사방법
이용자는 개인정보주체로서 다음과 같은 권리를 행사할 수 있습니다.
① 정보주체는 북스타에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
- 개인정보 열람요구
- 오류 등이 있을 경우 정정 요구
- 삭제요구
- 처리정지 요구
''';
} 